# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
 
# Parameters
nc: 80 

  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
 
# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, DA, [128]]
  - [-1, 1, DADown, [256]]  # 3-P3/8
  - [-1, 6, DA, [256]]
  - [-1, 1, DADown, [512]]  # 5-P4/16
  - [-1, 6, DA, [512]]
  - [-1, 1, DADown, [1024]]  # 7-P5/32
  - [-1, 3, DA, [1024]]
  - [-1, 1, SPPF, [1024, 5]]  # 9
# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, DA, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, DA, [256]] # 15 (P3/8-small)

  - [-1, 1, DADown, [256]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, DA, [512]] # 18 (P4/16-medium)

  - [-1, 1, DADown, [512]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3, DA, [1024]] # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)
